Chaldal_PerformanceTest/Chaldal_T001/Chaldal_T001.html/statistics.json
{
  "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeSummaries?pageSize=100&pageNumber=1" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeSummaries?pageSize=100&pageNumber=1",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2781.4,
    "medianResTime" : 3432.0,
    "minResTime" : 425.0,
    "maxResTime" : 5739.0,
    "pct1ResTime" : 5739.0,
    "pct2ResTime" : 5739.0,
    "pct3ResTime" : 5739.0,
    "throughput" : 0.8712319219376198,
    "receivedKBytesPerSec" : 31.629632503484927,
    "sentKBytesPerSec" : 0.6125849451123889
  },
  "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeCategories" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeCategories",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1404.2,
    "medianResTime" : 901.0,
    "minResTime" : 594.0,
    "maxResTime" : 3688.0,
    "pct1ResTime" : 3688.0,
    "pct2ResTime" : 3688.0,
    "pct3ResTime" : 3688.0,
    "throughput" : 1.1731581417175034,
    "receivedKBytesPerSec" : 3.612273067221962,
    "sentKBytesPerSec" : 0.7962352622008447
  },
  "https://chaldal.com/yolk/api-v4/DailyDeal/GetDailyDeals" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/DailyDeal/GetDailyDeals",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 553.3000000000001,
    "medianResTime" : 517.5,
    "minResTime" : 186.0,
    "maxResTime" : 1167.0,
    "pct1ResTime" : 1160.0,
    "pct2ResTime" : 1167.0,
    "pct3ResTime" : 1167.0,
    "throughput" : 1.8429782528566163,
    "receivedKBytesPerSec" : 3.7057541236638407,
    "sentKBytesPerSec" : 1.2400507970880943
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14535.6,
    "medianResTime" : 15208.0,
    "minResTime" : 9683.0,
    "maxResTime" : 18201.0,
    "pct1ResTime" : 18201.0,
    "pct2ResTime" : 18201.0,
    "pct3ResTime" : 18201.0,
    "throughput" : 0.2745593322717039,
    "receivedKBytesPerSec" : 179.3301974939597,
    "sentKBytesPerSec" : 1.647087869282302
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1816.9499999999996,
    "medianResTime" : 1125.5,
    "minResTime" : 186.0,
    "maxResTime" : 7147.0,
    "pct1ResTime" : 4257.599999999999,
    "pct2ResTime" : 5681.399999999995,
    "pct3ResTime" : 7147.0,
    "throughput" : 2.195751221386617,
    "receivedKBytesPerSec" : 179.27113281893287,
    "sentKBytesPerSec" : 1.6465453800021959
  },
  "https://catalog.chaldal.com/searchOld" : {
    "transaction" : "https://catalog.chaldal.com/searchOld",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2310.85,
    "medianResTime" : 2132.0,
    "minResTime" : 222.0,
    "maxResTime" : 7147.0,
    "pct1ResTime" : 4560.000000000001,
    "pct2ResTime" : 7018.999999999998,
    "pct3ResTime" : 7147.0,
    "throughput" : 1.0978756106933085,
    "receivedKBytesPerSec" : 167.3577886555141,
    "sentKBytesPerSec" : 0.8979207265191854
  }
}