Chaldal_PerformanceTest/Chaldal_T002/Chaldal_T002.html/statistics.json
{
  "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeSummaries?pageSize=100&pageNumber=1" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeSummaries?pageSize=100&pageNumber=1",
    "sampleCount" : 15,
    "errorCount" : 1,
    "errorPct" : 6.6666665,
    "meanResTime" : 2877.933333333334,
    "medianResTime" : 3010.0,
    "minResTime" : 255.0,
    "maxResTime" : 4595.0,
    "pct1ResTime" : 4217.6,
    "pct2ResTime" : 4595.0,
    "pct3ResTime" : 4595.0,
    "throughput" : 0.6848689617386541,
    "receivedKBytesPerSec" : 23.218885903684594,
    "sentKBytesPerSec" : 0.48154848872249106
  },
  "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeCategories" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeCategories",
    "sampleCount" : 15,
    "errorCount" : 1,
    "errorPct" : 6.6666665,
    "meanResTime" : 3648.2666666666664,
    "medianResTime" : 3873.0,
    "minResTime" : 1731.0,
    "maxResTime" : 5971.0,
    "pct1ResTime" : 5764.6,
    "pct2ResTime" : 5971.0,
    "pct3ResTime" : 5971.0,
    "throughput" : 0.7156830001431367,
    "receivedKBytesPerSec" : 2.069842833031156,
    "sentKBytesPerSec" : 0.4857418799799609
  },
  "https://chaldal.com/yolk/api-v4/DailyDeal/GetDailyDeals" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/DailyDeal/GetDailyDeals",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 916.4999999999999,
    "medianResTime" : 559.0,
    "minResTime" : 325.0,
    "maxResTime" : 4107.0,
    "pct1ResTime" : 1927.6000000000004,
    "pct2ResTime" : 3061.9999999999986,
    "pct3ResTime" : 4107.0,
    "throughput" : 1.3055398407241394,
    "receivedKBytesPerSec" : 2.625104035206058,
    "sentKBytesPerSec" : 0.8784345217372383
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 15,
    "errorCount" : 1,
    "errorPct" : 6.6666665,
    "meanResTime" : 37326.46666666667,
    "medianResTime" : 39243.0,
    "minResTime" : 24176.0,
    "maxResTime" : 45062.0,
    "pct1ResTime" : 44379.2,
    "pct2ResTime" : 45062.0,
    "pct3ResTime" : 45062.0,
    "throughput" : 0.3291205897840969,
    "receivedKBytesPerSec" : 214.11520643403327,
    "sentKBytesPerSec" : 1.9744021318786202
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 120,
    "errorCount" : 2,
    "errorPct" : 1.6666666,
    "meanResTime" : 4665.808333333336,
    "medianResTime" : 3166.5,
    "minResTime" : 191.0,
    "maxResTime" : 20534.0,
    "pct1ResTime" : 11799.2,
    "pct2ResTime" : 14819.599999999997,
    "pct3ResTime" : 20024.32999999998,
    "throughput" : 2.6391607468824914,
    "receivedKBytesPerSec" : 214.6190734002837,
    "sentKBytesPerSec" : 1.9790483969847588
  },
  "https://catalog.chaldal.com/searchOld" : {
    "transaction" : "https://catalog.chaldal.com/searchOld",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7241.816666666666,
    "medianResTime" : 6688.5,
    "minResTime" : 191.0,
    "maxResTime" : 20534.0,
    "pct1ResTime" : 14806.199999999999,
    "pct2ResTime" : 17120.449999999993,
    "pct3ResTime" : 20534.0,
    "throughput" : 1.3195803734412457,
    "receivedKBytesPerSec" : 201.15398420489782,
    "sentKBytesPerSec" : 1.079246643317425
  }
}