Chaldal_PerformanceTest/Chaldal_T005/Chaldal_T005.html/statistics.json
{
  "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeSummaries?pageSize=100&pageNumber=1" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeSummaries?pageSize=100&pageNumber=1",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11282.025000000001,
    "medianResTime" : 8061.5,
    "minResTime" : 689.0,
    "maxResTime" : 66425.0,
    "pct1ResTime" : 22244.399999999998,
    "pct2ResTime" : 31435.09999999998,
    "pct3ResTime" : 66425.0,
    "throughput" : 0.27774305989529086,
    "receivedKBytesPerSec" : 10.083374994792317,
    "sentKBytesPerSec" : 0.1952880889888764
  },
  "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeCategories" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/Recipe/GetAllRecipeCategories",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5941.550000000002,
    "medianResTime" : 3992.5,
    "minResTime" : 470.0,
    "maxResTime" : 28224.0,
    "pct1ResTime" : 13268.5,
    "pct2ResTime" : 20774.549999999974,
    "pct3ResTime" : 28224.0,
    "throughput" : 0.25723968951169474,
    "receivedKBytesPerSec" : 0.7920671299124741,
    "sentKBytesPerSec" : 0.17459139083069125
  },
  "https://chaldal.com/yolk/api-v4/DailyDeal/GetDailyDeals" : {
    "transaction" : "https://chaldal.com/yolk/api-v4/DailyDeal/GetDailyDeals",
    "sampleCount" : 80,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1304.5249999999999,
    "medianResTime" : 929.0,
    "minResTime" : 204.0,
    "maxResTime" : 12462.0,
    "pct1ResTime" : 2861.1000000000017,
    "pct2ResTime" : 3926.400000000002,
    "pct3ResTime" : 12462.0,
    "throughput" : 0.5790555603810186,
    "receivedKBytesPerSec" : 1.1643314441645676,
    "sentKBytesPerSec" : 0.38961843857668144
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 40,
    "errorCount" : 2,
    "errorPct" : 5.0,
    "meanResTime" : 126083.29999999999,
    "medianResTime" : 121766.5,
    "minResTime" : 93486.0,
    "maxResTime" : 205794.0,
    "pct1ResTime" : 158424.19999999998,
    "pct2ResTime" : 173979.99999999997,
    "pct3ResTime" : 205794.0,
    "throughput" : 0.19296172121855326,
    "receivedKBytesPerSec" : 123.49224158204493,
    "sentKBytesPerSec" : 1.1496391766564558
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 320,
    "errorCount" : 2,
    "errorPct" : 0.625,
    "meanResTime" : 15760.412500000006,
    "medianResTime" : 4893.0,
    "minResTime" : 189.0,
    "maxResTime" : 160653.0,
    "pct1ResTime" : 42461.90000000002,
    "pct2ResTime" : 62206.449999999975,
    "pct3ResTime" : 142865.3700000004,
    "throughput" : 1.5447146622384846,
    "receivedKBytesPerSec" : 123.57391082531208,
    "sentKBytesPerSec" : 1.1503994686422925
  },
  "https://catalog.chaldal.com/searchOld" : {
    "transaction" : "https://catalog.chaldal.com/searchOld",
    "sampleCount" : 160,
    "errorCount" : 2,
    "errorPct" : 1.25,
    "meanResTime" : 26562.66875,
    "medianResTime" : 17879.0,
    "minResTime" : 189.0,
    "maxResTime" : 160653.0,
    "pct1ResTime" : 59785.00000000002,
    "pct2ResTime" : 95868.99999999994,
    "pct3ResTime" : 156559.28999999992,
    "throughput" : 0.7723573311192423,
    "receivedKBytesPerSec" : 115.19281553813998,
    "sentKBytesPerSec" : 0.6237407709332974
  }
}